#ifndef CONFIG_H
#define CONFIG_H

/****************************************************
 *  Конфигурация проекта
 *  Выбор устройства управления:
 *
 *  1) ЭНКОДЕР (EncButton eb)
 *  2) КНОПКИ  (btnOk, btnUp, btnDown)
 *
 *  Для выбора варианта — раскомментируй один из блоков
 ****************************************************/

// --------------------------------------------------
// Выбрать управление ЭНКОДЕРОМ
// --------------------------------------------------
// #define CONTROL_ENCODER

// --------------------------------------------------
// Выбрать управление КНОПКАМИ
// --------------------------------------------------
 #define CONTROL_BUTTONS


// --------------------------------------------------
// Проверка конфигурации (чтобы не включили оба сразу)
// --------------------------------------------------
#if defined(CONTROL_ENCODER) && defined(CONTROL_BUTTONS)
#error "Нельзя использовать CONTROL_ENCODER и CONTROL_BUTTONS одновременно!"
#endif

#if !defined(CONTROL_ENCODER) && !defined(CONTROL_BUTTONS)
#error "Нужно выбрать хотя бы один режим управления!"
#endif

#endif // CONFIG_H
